app/Controllers/Masterdata.php

SELECT `s`.*, `o`.`ShortName` AS `OfficeName`
FROM `tbllookup_signatory` `s`
INNER JOIN `office` `o` ON `o`.`OfficeCode` = `s`.`OfficeCode`
WHERE `s`.`IsActive` = 1
AND `s`.`OfficeCode` IN ('200')
ORDER BY `o`.`ShortName` ASC, `s`.`Module` ASC
---
    public function getSignatory()
    {
        if (!auth()->loggedIn()) {
            return redirect()->to('login');
        }
        if(!auth()->user()->inGroup('payroll hr') && !auth()->user()->inGroup('payroll') && !auth()->user()->inGroup('admin')){
            return redirect()->to('login');
        }

        $user = $this->auth->user();
        $officeModel = new \App\Models\OfficeModel();

        $data['record_office'] = $officeModel->getOfficesByUser($user);
        $keyword = $this->request->getGet('keyword') ?? '';

        $builder = $this->db->table('tbllookup_signatory s');
        $builder->select("s.*,o.ShortName AS OfficeName");
        $builder->join('office o', 'o.OfficeCode = s.OfficeCode', 'inner');
        $builder->where('s.IsActive', 1);
        if (!auth()->user()->inGroup('payroll hr') && !auth()->user()->inGroup('admin')) {
            $builder->whereIn('s.OfficeCode', $officeModel->getOfficeCodeArray($user));
        }
        if ($keyword != '') {
            $builder->like("o.OfficeName", $keyword);
        }
        $builder->orderBy('o.ShortName', 'ASC');
        $builder->orderBy('s.Module', 'ASC');
        $data['record'] = $builder->get()->getResult();

SELECT `s`.*, `o`.`ShortName` AS `OfficeName`
FROM `tbllookup_signatory` `s`
INNER JOIN `office` `o` ON `o`.`OfficeCode` = `s`.`OfficeCode`
WHERE `s`.`IsActive` = 1
AND `s`.`OfficeCode` IN ('200')
---
    public function getSignatorylist()
    {
        if (!auth()->loggedIn()) {
            return redirect()->to('login');
        }
        if(!auth()->user()->inGroup('payroll hr') && !auth()->user()->inGroup('payroll') && !auth()->user()->inGroup('admin')){
            return redirect()->to('login');
        }

        $user = $this->auth->user();
        $officeModel = new \App\Models\OfficeModel();

        $data['record_office'] = $officeModel->getOfficesByUser($user);
        $keyword = $this->request->getGet('keyword') ?? '';

        $builder = $this->db->table('tbllookup_signatory s');
        $builder->select("s.*,o.ShortName AS OfficeName");
        $builder->join('office o', 'o.OfficeCode = s.OfficeCode', 'inner');
        $builder->where('s.IsActive', 1);
        if (!auth()->user()->inGroup('payroll hr') && !auth()->user()->inGroup('admin')) {
            $builder->whereIn('s.OfficeCode', $officeModel->getOfficeCodeArray($user));
        }
        if ($keyword != '') {
            $builder->like("o.OfficeName", $keyword);
        }
        $data = $builder->get()->getResult();