app/Controllers/Securityquestion.php

INSERT INTO `login_log` (`username`, `loginwhen`, `loginwhere`, `remarks`) VALUES ('20893Nomus', '2026-05-17 12:36:56', '127.0.0.1', 'Success')
---
    public function getIndex()
     {
        // Shield authentication check
        if (!auth()->loggedIn()) {
            return redirect()->to('/login');
        }

        $user = auth()->user();

        // Login log
        $transaction = [
            'username'   => $user->username,
            'loginwhen'  => date('Y-m-d H:i:s'),
            'loginwhere' => $this->request->getIPAddress(),
            'remarks'    => 'Success',
        ];

        $this->db->table('login_log')->insert($transaction);

SELECT `id`
FROM `tbldevice`
WHERE `DeviceMacAddress` = 'Firefox 151.0Windows 10127.0.0.1'
AND `IsActive` = 1
---
        $MAC = $deviceAgent . $agent->getPlatform() . $this->request->getIPAddress();

        // Check authorized device
        $device = $this->db->table('tbldevice')
            ->select('id')
            ->where('DeviceMacAddress', $MAC)
            ->where('IsActive', 1)
            ->get()
            ->getRow();

SELECT `id`, `PrecinctNumber`
FROM `tblprecinct`
WHERE `OfficeCode` = '200'
AND `DeviceID` = '1'
AND `IsActive` = 1
---
            session()->set('DeviceID', $device->id);

            // Check precinct
            $precinct = $this->db->table('tblprecinct')
                ->select('id, PrecinctNumber')
                ->where('OfficeCode', $user->OfficeCode)
                ->where('DeviceID', $device->id)
                ->where('IsActive', 1)
                ->get()
                ->getRow();