app/Controllers/Vote.php

	public function postVote_unlock()
	{
		if (!auth()->user()->inGroup('admin')) {return redirect()->to('/logout');}

		$transaction = [ 'IsVoteLock' => 0 ];
		$this->db->table('tblsettings')->update($transaction);
---
UPDATE `tblsettings` SET `IsVoteLock` = 0